app/controllers/posts_controller.rb

def create
@post = current_user.posts.build(post_params)
if @post.save
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["title", "First post"], ["body", "Qwerty"], ["created_at", "2017-10-20 08:24:11.937020"], ["updated_at", "2017-10-20 08:24:11.937020"]]

def update
@post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Post 3"], ["updated_at", "2017-10-20 11:30:25.450868"], ["id", 3]]